
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записать();
	Движения.Управленческий.Записывать = Истина;

	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Управленческий.Сотрудники;
	Движение.СчетКт = ПланыСчетов.Управленческий.Касса;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Филиалы] = Филиал;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Сотрудник;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Филиалы] = Филиал;

КонецПроцедуры
